export default [
  {
    text: 'Привет! Будет идеально, если ты заглянешь за винишком. Прихвати шираз :)',
    date: 'вчера, 11:31',
    type: 'incoming',
  },
  {
    text: 'Привет! Будет идеально, если ты заглянешь за сочком. Прихвати апельсиновый :)',
    date: 'сегодня, 10:20',
    type: 'outcoming',
  },
  {
    text: 'Привет! Будет идеально, если ты заглянешь за хлебчиком. Прихвати батончик :)',
    date: 'вчера, 22:31',
    type: 'incoming',
  },
  {
    text: 'Привет! Будет идеально, если ты заглянешь за изолентой. Прихвати синюю :)',
    date: 'вчера, 17:22',
    type: 'outcoming',
  },
  {
    text: 'Привет! :)',
    date: 'вчера, 17:22',
    type: 'outcoming',
  },
  {
    text: 'Ретрокомпьютерщики бывают различной степени привередливости.',
    date: 'сегодня, 15:40',
    type: 'incoming',
  },
  {
    text: 'Одни довольствуются эмуляцией.',
    date: 'вчера, 11:31',
    type: 'incoming',
  },
  {
    text: 'Но процессору для работы нужно столько всего!',
    date: 'сегодня, 10:20',
    type: 'outcoming',
  },
  {
    text: 'Настоящий восьмибитный микропроцессор выполняет программы.',
    date: 'вчера, 22:31',
    type: 'incoming',
  },
  {
    text: 'Проектируйте виртуальную периферию в Arduino IDE',
    date: 'вчера, 17:22',
    type: 'outcoming',
  },
  {
    text: 'Поддерживаемые микропроцессоры: 6502, 6809 и Z80 (КР1858ВМ1), на подходе — другие.',
    date: 'вчера, 17:22',
    type: 'outcoming',
  },
  {
    text: 'Шилд с микропроцессором не мешает подключать другие шилды: с ЖКИ, картами памяти, и др.',
    date: 'сегодня, 15:40',
    type: 'incoming',
  },
  {
    text: 'Правда, микропроцессор будет работать на очень небольшой частоте — порядка 95 кГц',
    date: 'вчера, 11:31',
    type: 'incoming',
  },
  {
    text: 'Распределение адресного пространства задаётся программно в скетче.',
    date: 'сегодня, 10:20',
    type: 'outcoming',
  },
  {
    text: 'При помощи последовательного порта Arduino Mega можно эмулировать UART.',
    date: 'вчера, 22:31',
    type: 'incoming',
  },
  {
    text: 'Схемы, чертежи плат, Gerber-файлы доступны под CC-BY-SA 4.0 здесь.',
    date: 'вчера, 17:22',
    type: 'outcoming',
  },
  {
    text: 'Схема устройства на 6502',
    date: 'вчера, 17:22',
    type: 'outcoming',
  },
  {
    text: 'Схема устройства на 6809',
    date: 'вчера, 17:22',
    type: 'outcoming',
  },
  {
    text: 'Схема устройства на Z80',
    date: 'сегодня, 15:40',
    type: 'incoming',
  },
];
